Catalogs/ДокументИсходящий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>ДокументИсходящий</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресАдресата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адресат</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешнийДокумент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСтатуса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжникСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсполнительСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазваниеДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазваниеДокументаСправочник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НазванияДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДоговора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оператор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрационныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаНаДокумент</Name>
					<Type>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Стадия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтадияДокумента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусДоставки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипДокумента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШифрНазвания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШПИ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ТипДокумента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ТипДокумента</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>исх</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>вх</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/НазванияДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>НазванияДокументов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НазваниеДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасширениеНазвания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Стадия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтадияДокумента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипДокумента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШифрНазвания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ДокументИсходящий/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.ДатаСоздания) = Ложь Тогда
		Объект.ДатаСоздания = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Исполнитель) = Ложь Тогда
		Объект.Исполнитель = ПараметрыСеанса.Пользователь;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Оператор) = Ложь Тогда
		Объект.Оператор = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ТипДокумента) = Ложь Тогда
		Объект.ТипДокумента = Перечисления.ТипДокумента.исх;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.НазваниеДокумента) = Ложь И ЗначениеЗаполнено(Объект.НазваниеДокументаСправочник) Тогда
		Объект.НазваниеДокумента = Объект.НазваниеДокументаСправочник.ПолноеНаименование;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ИсполнительСтрокой) = Ложь И ЗначениеЗаполнено(Объект.Исполнитель) Тогда
		Объект.ИсполнительСтрокой = Объект.Исполнитель;
	КонецЕсли;
	
	ЗаполнитьНазванияДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЭтотОбъект.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс;
	ЗаполнитьНазванияДокументов();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(ТекущийОбъект.ДатаСоздания) = Ложь Тогда
		ТекущийОбъект.ДатаСоздания = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущийОбъект.Исполнитель) = Ложь Тогда
		ТекущийОбъект.Исполнитель = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНазванияДокументов()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	НазванияДокументов.НазваниеДокумента КАК НазваниеДокумента
	               |ИЗ
	               |	Справочник.НазванияДокументов КАК НазванияДокументов
	               |ГДЕ
	               |	1 = 1
	               |	И НазванияДокументов.Стадия = &Стадия
	               |	И НазванияДокументов.ТипДокумента = &ТипДокумента";
	
	Запрос.УстановитьПараметр("ТипДокумента", Объект.ТипДокумента);
	
	Если ЗначениеЗаполнено(Объект.Стадия) Тогда
		Запрос.УстановитьПараметр("Стадия", Объект.Стадия);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И НазванияДокументов.Стадия = &Стадия", "");
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	СписокНазванийДокументов = Элементы.НазваниеДокументаВыбор.СписокВыбора;
	СписокНазванийДокументов.Очистить();
	Пока Выборка.Следующий() Цикл
		СписокНазванийДокументов.Добавить(Выборка.НазваниеДокумента);
	КонецЦикла;
	
	Если ЗначениеЗаполнено(НазваниеДокументаВыбор) Тогда
		Если СписокНазванийДокументов.НайтиПоЗначению(НазваниеДокументаВыбор) = Неопределено Тогда
			НазваниеДокументаВыбор = "";
			ЗаполнитьРасширенияНазванийДокументов();
			ОбновитьНаименованиеДокумента();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРасширенияНазванийДокументов()
	
	СписокРаширенийНазванийДокументов = Элементы.РасширениеНазвания.СписокВыбора;
	СписокРаширенийНазванийДокументов.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	НазванияДокументов.РасширениеНазвания КАК РасширениеНазвания
	               |ИЗ
	               |	Справочник.НазванияДокументов КАК НазванияДокументов
	               |ГДЕ
	               |	1 = 1
	               |	И НазванияДокументов.Стадия = &Стадия
	               |	И НазванияДокументов.ТипДокумента = &ТипДокумента
	               |	И НазванияДокументов.НазваниеДокумента = &НазваниеДокумента";
	
	Если ЗначениеЗаполнено(НазваниеДокументаВыбор) = Ложь Тогда
		РасширениеНазвания = "";
		Возврат;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ТипДокумента", Объект.ТипДокумента);
	Запрос.УстановитьПараметр("НазваниеДокумента", НазваниеДокументаВыбор);
	
	Если ЗначениеЗаполнено(Объект.Стадия) Тогда
		Запрос.УстановитьПараметр("Стадия", Объект.Стадия);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ШаблоныНазванийДокументов.Стадия = &Стадия", "");
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СписокРаширенийНазванийДокументов.Добавить(Выборка.РасширениеНазвания);
	КонецЦикла;
	
	Если СписокРаширенийНазванийДокументов.НайтиПоЗначению(РасширениеНазвания) = Неопределено Тогда
		СписокРаширенийНазванийДокументов = "";
		РасширениеНазвания = "";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НазваниеДокументаВыборПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(НазваниеДокументаВыбор) Тогда
		ЗаполнитьРасширенияНазванийДокументов();
		ОбновитьНаименованиеДокумента();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РасширениеНазванияПриИзменении(Элемент)
	
	ОбновитьНаименованиеДокумента();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьНаименованиеДокумента()
	
	НаименованиеДокумента = СтрШаблон("%1 %2", ТРег(НазваниеДокументаВыбор), НРег(РасширениеНазвания));
	ЗаполнитьШифрНазвания();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьШифрНазвания()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	НазванияДокументов.НазваниеДокумента КАК НазваниеДокумента,
	               |	НазванияДокументов.РасширениеНазвания КАК РасширениеНазвания,
	               |	НазванияДокументов.ШифрНазвания КАК ШифрНазвания,
	               |	НазванияДокументов.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.НазванияДокументов КАК НазванияДокументов
	               |ГДЕ
	               |	1 = 1
	               |	И НазванияДокументов.Стадия = &Стадия
	               |	И НазванияДокументов.ТипДокумента = &ТипДокумента
	               |	И НазванияДокументов.РасширениеНазвания = &РасширениеНазвания
	               |	И НазванияДокументов.НазваниеДокумента = &НазваниеДокумента";
	
	Запрос.УстановитьПараметр("ТипДокумента", Объект.ТипДокумента);
	Запрос.УстановитьПараметр("НазваниеДокумента", НазваниеДокументаВыбор);
	Запрос.УстановитьПараметр("РасширениеНазвания", РасширениеНазвания);
	
	Если ЗначениеЗаполнено(Объект.Стадия) Тогда
		Запрос.УстановитьПараметр("Стадия", Объект.Стадия);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ШаблоныНазванийДокументов.Стадия = &Стадия", "");
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Объект.ШифрНазвания = Выборка.ШифрНазвания;
		Объект.НазваниеДокументаСправочник = Выборка.Ссылка;
	КонецЦикла;
	
КонецПроцедуры
